Redis 中的键（key）都是字符串，但是值可以有多种类型（常见五种）。

字符串类型的值（Value）最大不能超过 512M<small>（已经足够大了）</small>。

一般情况下，考虑到并发、流量等问题，通常字符串类型的值最大也只是 百K 级别。

使用场景：

- 缓存
- 计数器
- 分布式锁

# 主要命令：

| 命令 | 语法 |
| :- | :- |
| get | `get <key>` |
| set | `set <key> <value>` |
| del | `del <key>` |

## Set 命令

Set 命令用于设置某个键值对的值（String），具体是哪个简直对由参数 *key* 决定。

如果键值对中已有值，Set 就覆写旧值，且无视旧类型（即，赋完值后为 String 型）。

### 语法

  `set <key> <value>`


### 返回值

  在 Redis 2.6.12 以前版本， Set 命令总是返回 OK 。<br>

  从 Redis 2.6.12 版本开始， Set 在设置操作成功完成时，才返回 OK 。

### 实例

首先，我们在 redis 中创建一个 key 并设置值。

对不存在的键进行设置

    redis 127.0.0.1:6379> SET key "value"
    OK
    
    redis 127.0.0.1:6379> GET key
    "value"

对已存在的键进行设置

    redis 127.0.0.1:6379> SET key "new-value"
    OK
    
    redis 127.0.0.1:6379> GET key
    "new-value"



set 一个不存在的 key ，就是新增一个键值对；set 一个已存在的 key ，就是更新这个键值对。


## 带参数的 Set 命令

```sh
> set <key> <val>
# 无论 key 是否存在，都进行设置


> set <key> <val> NX
# key 不存在，才设置；等同于 setnx <key> <val>
# 真正意义上的“新增”操作，因为要求之前是必须没有的。

> set <key> <val> XX
# key 存在，才设置
# 真正意义上的“更新”操作，因为要求之前是必须有的。
```


## Get

Get 命令用于获取某个键值对的值（String），具体是哪个键值对由参数 *key* 决定。

如果键值对不存在，则返回 nil 。

如果键值对的值部分并非字符串类型，则返回一个错误。

### 语法

```sh
get <key>
```

### 返回值

- 返回 *`key`* 对应的值，如果不存在时，则返回 nil。<br>

- 如果 *`key`* 对应的值不是字符串类型，则返回一个错误。简而言之，告诉你 get 命令用错地方了。

### 实例

对不存在的 *key* 或字符串类型 *key* 进行 Get

    redis> GET db
    (nil)
    
    redis> SET db redis
    OK
    
    redis> GET db
    "redis"


对不是字符串类型的 *key* 进行 GET

    redis> DEL db
    (integer) 1
    
    在 redis 中添加一个 list 类型的键值对
    redis> LPUSH db redis mongodb mysql
    (integer) 3
    
    redis> GET db
    (error) ERR Operation against a key holding the wrong kind of value


## del 命令

del 命令用于删除某个键值对。

如果 *key* 代表的键值对不存在，则该操作无任何效果。

实际上 del 命令是一个通用命令，各种类型结构都有这个命令。

### 语法

    del <key>


### 返回值

    被删除的键值对的数量。

### 实例

首先，我们在 redis 中创建一个 *key* 并设置值 。

    redis 127.0.0.1:6379> SET w3ckey redis
    OK

现在我们删除已创建的 *key* 。

    redis 127.0.0.1:6379> DEL w3ckey
    (integer) 1


### 案例：

- 计数器：记录网站每个用户个人主页的访问量
- 缓存：缓存视频的基本信息<small>（视频本身在 MySQL 中）</small>
- 分布式 id 生成

# 次要命令  

- incr
- decr
- incrby
- decrby

前提要求，value 必须是数值型字符串

## incr

key 对应的 val 自增 1 。

如果 *键值对* 不存在，那么会新增该 *键值对* 其值会先被初始化为 0 ，然后再执行 incr 操作

### 语法

    incr <key>

### 返回值

执行完 Incr 命令之后，*键值对* 的值。

### 实例

    redis> SET page_view 20
    OK
    
    redis> INCR page_view
    (integer) 21
    
    redis> GET page_view    # 数字值在 Redis 中以字符串的形式保存
    "21"

## decr 命令

decr 命令将某个 *键值对* 的 *数值型字符串值* 减一。

如果 *键值对* 不存在，那么会新建该键值对，并将其值初始化为 0 ，然后再执行 decr 操作。

### 语法

    decr <key>

### 返回值

    新值，即减 1 之后的值

### 实例

对存在的数字值 key 进行 decr

    redis> SET failure_times 10
    OK
    
    redis> DECR failure_times
    (integer) 9


对不存在的 key 值进行 decr

    redis> EXISTS count
    (integer) 0
    
    redis> DECR count
    (integer) -1


对存在但不是数值的 key 进行 Decr

    redis> SET company YOUR_CODE_SUCKS.LLC
    OK
    
    redis> DECR company
    (error) ERR value is not an integer or out of range


## incrby 命令

incrby 命令用于将某个 *键值对* 中的 *数字型字符串值* 加上指定的增量值。

如果 *键值对* 不存在，那么会新建键值对，并将其值初始化为 0 ，然后再执行 incrby 命令。

### 语法

    incrby <key> <amount>

### 返回值

    新值。即，增加指定增量之后的值。

### 实例

key 存在且是数字值

    redis> SET rank 50
    OK
    
    redis> INCRBY rank 20
    (integer) 70
    
    redis> GET rank
    "70"


key 不存在时

    redis> EXISTS counter
    (integer) 0
    
    redis> INCRBY counter 30
    (integer) 30
    
    redis> GET counter
    "30"


key 不是数字值时

    redis> SET book "long long ago..."
    OK
    
    redis> INCRBY book 200
    (error) ERR value is not an integer or out of range


## decrby 命令

decrby 命令用于将某个键值对的值减去指定的减量值，具体是哪个键值对由参数 *key* 决定。

要求键值对的值必须是数字型字符串。

如果键值对不存在，那么将新建键值对，将其值初始化为 0 ，然后再执行 Decrby 操作。

如果键值对额值不是 String 类型，或不是数字型 String 类型，那么返回一个错误。

### 语法

    decrby <key> <amount>

### 返回值

    新值。即，减去指定量之后的值。

### 实例

对已存在的 key 进行 DECRBY

    redis> SET count 100
    OK
    
    redis> DECRBY count 20
    (integer) 80


对不存在的 key 进行DECRBY

    redis> EXISTS pages
    (integer) 0
    
    redis> DECRBY pages 10
    (integer) -10


# 其他命令

- mget

  ```sh
  > mget <key1> <key2> <key3> ...
  # 批量获得 key 对应的值
  # 原子操作，O(n) 复杂度
  ```


- mset

  ```sh
  > mset <key-1> <val-1> <key-2> <val-2> <key-3> <val-3> ...
  # 批量设置键值对
  ```

- getset

  ```sh
  > getset <key> <new-value>
  # 为键值对设置一个新值，于此同时返回原来的值
  ```

- append

  ```sh
  > append <key> <val>
  # 将 val 追加到键值对的值后
  ```

- strlen

  ```sh
  > strlen <key>
  # 返回字符串的长度
  ```

- incrbyfloat

  ```sh
  > incrbyfloat <key> <val>
  # 键值对的值自增，val为浮点型字符串
  # 并没有浮点自减命令，但是可以传入一个负数实现自检减功能
  ```

- getrange


  ```sh
  > getrange <key> <start> <end>
  > # 获得指定范围区间中的值，包括 <end>
  ```

- setrange

  ```sh
  > setrange <key> <start> <end>
  > # 为值的指定区间赋值
  ```
